"""
Статический список узбекских групп филиала: (курс, название группы, group_id).
"""

GROUPS: list[tuple[str, str, int]] = [
    # --- I КУРС ---
    ("I курс", "УРИ-26-01", 10494),
    ("I курс", "УРС-26-02", 10545),
    ("I курс", "УРТ-26-03", 10481),
    ("I курс", "УГЦ-26-04", 10666),
    ("I курс", "УРБ-26-05", 10482),
    ("I курс", "УРГ-26-06", 10483),
    ("I курс", "УРН-26-07", 10544),
    ("I курс", "УТП-26-08", 10546),
    ("I курс", "УБМ-26-09", 10564),
    ("I курс", "УБС-26-10", 10612),
    ("I курс", "УЭМ-26-11", 10613),
    ("I курс", "УЭЭ-26-12", 10614),

    # --- II КУРС ---
    ("II курс", "УРИ-25-01", 10117),
    ("II курс", "УРС-25-02", 10250),
    ("II курс", "УРТ-25-03", 10145),
    ("II курс", "УГЦ-25-04", 10303),
    ("II курс", "УРБ-25-05", 10118),
    ("II курс", "УРГ-25-06", 10119),
    ("II курс", "УРН-25-07", 10174),
    ("II курс", "УТП-25-08", 10176),
    ("II курс", "УЭМ-25-09", 10175),
    ("II курс", "УЭЭ-25-10", 10186),
    ("II курс", "УБМ-25-11", 10207),

    # --- III КУРС ---
    ("III курс", "УРТ-24-01", 9781),
    ("III курс", "УРС-24-02", 9806),
    ("III курс", "УРИ-24-03", 9807),
    ("III курс", "УГИ-24-04", 9814),
    ("III курс", "УГЦ-24-05", 9815),
    ("III курс", "УРБ-24-06", 9782),
    ("III курс", "УРГ-24-07", 9784),
    ("III курс", "УРН-24-08", 9783),
    ("III курс", "УТП-24-09", 9879),
    ("III курс", "УТС-24-10", 9878),
    ("III курс", "УЭМ-24-11", 9837),
    ("III курс", "УЭЭ-24-12", 9838),
    ("III курс", "УЭЭ-24-13", 9905),

    # --- IV КУРС ---
    ("IV курс", "УРТ-23-01", 9093),
    ("IV курс", "УРС-23-02", 9435),
    ("IV курс", "УГИ-23-03", 9346),
    ("IV курс", "УГЦ-23-04", 9347),
    ("IV курс", "УРБ-23-05", 9339),
    ("IV курс", "УРГ-23-06", 9340),
    ("IV курс", "УРН-23-07", 9341),
    ("IV курс", "УТП-23-08", 9342),
    ("IV курс", "УТС-23-09", 9343),
    ("IV курс", "УЭМ-23-10", 9344),
    ("IV курс", "УЭЭ-23-11", 9345),
    ("IV курс", "УРС-23-12", 9506),

    # --- V КУРС ---
    ("V курс", "УГИ-22-08", 9011),
    ("V курс", "УГФ-22-09", 9014),
]
